{
  "phrases": [
    "Software Developer",
    "Web Developer",
    "Frontend Developer",
    "Backend Developer",
    "Full Stack Developer",
    "UBC Student",
    "Former OSU Student",
    "International Student from China",
    "Computer Science Student",
    "Statistics Student",
    "Data Science Enthusiast",
    "Machine Learning Enthusiast",
    "Computer Graphics Enthusiast",
    "Amateur Photographer",
    "Open Source Contributor",
    "Problem Solver",
    "Lifelong Learner",
    "PLAI co-op intern",
    "Former TA at UBC",
    "DevOps Enthusiast",
    "Violin Player",
    "Aviation Fan",
    "Manga Reader",
    "Cat Owner",
    "Harbin-er",
    "Minecraft Player",
    "Minecraft Server Manager",
    "Minecraft Mod & Plugin Developer",
    "War Thunder Player",
    "Total War Player"
  ],
  "paragraphs": [
    "I'm currently at my third year pursuing a combined major in Computer Science and Statistics at UBC. My academic journey and personal projects reflect my passion for problem-solving, innovation, and continuous learning.",
    "I am interested in areas like machine learning, full-stack web development, DevOps and server management, computer graphics, database design and maintenance, and software engineering. I have had personal or work experiences in many of these areas, and am always eager to learn more.",
    "I have a strong foundation in programming languages such as TypeScript, Java, Python, and C++, and I am proficient in various frameworks and tools like React, Node.js, Express.js, Docker, and SQL databases. I also have experience with cloud platforms like AWS.",
    "My major, as a combination of computer programming and math/statistical analysis, has equipped me with a solid foundation in both theoretical and practical aspects of computer science and statistics. I have developed a keen interest in data analysis, machine learning, and statistical modeling, and I am excited to apply these skills in real-world applications.",
    "I'm always eager to explore new technologies and take on challenging projects that allow me to grow as a developer, and, as a better person. Contact me if you want to know more or collaborate on a project!"
  ]
}
