{
  "phrases": [
    "Cloud Ops Database Engineer",
    "Database Engineer",
    "DevOps Engineer",
    "Software Engineer",
    "Full Stack Developer",
    "Infrastructure Engineer",
    "Former OSU Student",
    "International Student from China",
    "Computer Science Student",
    "Statistics Student",
    "Cloud Infrastructure Specialist",
    "Kubernetes Enthusiast",
    "Database Administration Specialist",
    "Terraform Practitioner",
    "AWS Solutions User",
    "Automation Enthusiast",
    "Problem Solver",
    "Lifelong Learner",
    "Former PLAI Research Engineer",
    "Former UBC TA",
    "Open Source Contributor",
    "Amateur Photographer",
    "Violin Player",
    "Aviation Fan",
    "Manga Reader",
    "Cat Owner",
    "Minecraft Player",
    "Minecraft Server Manager",
    "Minecraft Mod & Plugin Developer",
    "War Thunder Player",
    "Total War Player"
  ],
  "paragraphs": [
    "I'm a Computer Science and Statistics student at UBC, currently on co-op as a Cloud Ops Database Engineer at Samsung R&D Canada. I'm passionate about technology, problem-solving, and continuous learning.",
    "At Samsung, I work on cloud infrastructure and database operations, building tools for account management and implementing Kubernetes and Terraform solutions. I also enjoy contributing to research projects at UBC's PLAI lab, where I develop Minecraft plugins and AI agent frameworks.",
    "I have experience with various technologies including Kubernetes, Docker, AWS, Python, TypeScript, and Java. I've worked with databases like MySQL, PostgreSQL, and MongoDB, and I enjoy automating workflows and building monitoring solutions.",
    "Beyond coding, I'm an amateur photographer, violin player, and aviation enthusiast. I love playing Minecraft (and have developed mods & plugins for it!), reading manga, and spending time with my cat. I also enjoy strategy games like War Thunder and Total War.",
    "I'm always eager to explore new technologies and collaborate on interesting projects. Feel free to reach out if you'd like to connect!"
  ]
}
